In [3]:
import pandas as pd
from sklearn.cluster import KMeans

In [4]:
dataset = pd.read_csv('Mall_Customers.csv')
dataset.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [5]:
x = dataset.drop(['Gender','CustomerID','Age'],axis=True)
x

     Annual Income (k$)  Spending Score (1-100)
0                    15                      39
1                    15                      81
2                    16                       6
3                    16                      77
4                    17                      40
..                  ...                     ...
195                 120                      79
196                 126                      28
197                 126                      74
198                 137                      18
199                 137                      83

[200 rows x 2 columns]

In [6]:
Kmeans = KMeans(n_clusters=5,init='k-means++',random_state=43)

In [7]:
y_predict = Kmeans.fit_predict(x)

In [8]:
test = Kmeans.predict([[137,78]])
test

c:\Users\vishnuvarthan s\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\utils\validation.py:2749: UserWarning: X does not have valid feature names, but KMeans was fitted with feature names
  warnings.warn(

array([3], dtype=int32)